data/cfdb/verification/pipe_poiseuille/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// nu = 5e-5 m^2/s -> Re_D = U_mean * D / nu = 0.1 * 0.01 / 5e-5 = 20 (laminar)
transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 5e-5;

// ************************************************************************* //
