data/cfdb/verification/pipe_poiseuille/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Axisymmetric 5-degree wedge of a straight circular pipe:
//   R = 0.005 m, L = 0.12 m, flow along +x, axis on the x-axis.
// Collapsed-axis layout follows the official ESI v2312 tutorial
// incompressible/pimpleFoam/laminar/movingCone/system/blockMeshDict:
// duplicate axis vertex labels inside the hex, mergeType points, and a
// degenerate 'axis' patch of type empty.
// Half-angle 2.5 deg:  R*cos = 0.00499524107,  R*sin = 0.00021809695.

mergeType points;   // Wedge geometry - merge points instead of topology

scale   1;

vertices
(
    (0     0            0)            // 0  axis, inlet  (x=0)
    (0.12  0            0)            // 1  axis, outlet (x=L)
    (0     0.00499524107 -0.00021809695)  // 2  wall, inlet,  back  (-z)
    (0.12  0.00499524107 -0.00021809695)  // 3  wall, outlet, back
    (0     0.00499524107  0.00021809695)  // 4  wall, inlet,  front (+z)
    (0.12  0.00499524107  0.00021809695)  // 5  wall, outlet, front
);

blocks
(
    // (axis_in, axis_out, wall_out_back, wall_in_back,
    //  axis_in, axis_out, wall_out_front, wall_in_front)
    // directions: (axial, radial, collapsed azimuthal) = (120, 20, 1)
    hex (0 1 3 2 0 1 5 4) (120 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 0 4 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 1 3 5)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (2 4 5 3)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 5 4)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 2 3 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
